'''
随机森林(Random Forest)
    随机森林不是有很多树 而是有很多不一样的树 很多决策树一起做决定

为什么要使用决策树森林？
    因为只用一棵决策树来预测结果 会产生过拟合 一棵树太容易犯错 那就让多棵树一起判断
    随机森林可以允许一棵树犯错 但是整体不会太受到影响
    随机森林能够稀释异常预测 提高模型的稳定性

随机(Random)体现在哪里？
    1、随机抽取训练数据(Bootstrap)
        每一棵树都会从训练集中随机抽取对应的样本树 可以重复抽样 所以每一个树得到的训练数据都是不一样的
        如果不允许重复抽样 结果每棵树得到的数据只是顺序不一样 数据根本不变
    2、随机选择特征(Feature Sampling)
        每一棵树会对所有的特征进行随机抽取 也就是说每一棵树关注的主要内容是不一样的

随机森林的两种情况:
    分类: 采用多数投票来决定
    回归: 采用求平均值来决定

随机森林的优缺点:
    优点:
        准确率高
        不容易过拟合
        抗噪声能力强
        稳定性好
    缺点:
        训练速度比单棵决策树慢
        模型体积更大
        可解释性没有单个决策树强

总结:随机森林（Random Forest）是一种集成学习算法，它通过对训练数据和特征进行随机采样，
构建多棵不同的决策树，并通过分类投票或回归求平均得到最终结果，从而降低过拟合，提高模型的准确率和稳定性。
'''
